app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = ? LIMIT ?  [["user_id", 1], ["movie_id", 1], ["LIMIT", 1]]
---
  def show
    @movie = Movie.find(params[:id])
    @fans = @movie.fans

    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)

UPDATE "movies" SET "description" = ?, "duration" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "I hear this movie sucked and no one actually saw it oh well"], ["duration", "1 minute"], ["updated_at", 2016-06-30 17:28:03 UTC], ["id", 1]]
---
  def update
    if @movie.update(movie_params)

INSERT INTO "movies" ("title", "rating", "total_gross", "created_at", "updated_at", "description", "released_on", "cast", "director", "duration", "image_file_name", "slug") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)
    if @movie.save

SELECT  "movies".* FROM "movies" WHERE "movies"."slug" = ? LIMIT ?  [["slug", "iron-man-6948250317"], ["LIMIT", 1]]
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])